---
title: KeyBasedTreeEntriesIterator
classe: Autodesk.Revit.DB.KeyBasedTreeEntriesIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# KeyBasedTreeEntriesIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `KeyBasedTreeEntry Current { get; }` | `keyBasedTreeEntriesIterator.Current` | KeyBasedTreeEntry |
| `Boolean IsValidObject { get; }` | `keyBasedTreeEntriesIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `keyBasedTreeEntriesIterator.Dispose()` | Void |
| `Boolean IsDone()` | `keyBasedTreeEntriesIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `keyBasedTreeEntriesIterator.MoveNext()` | Boolean |
| `Void Reset()` | `keyBasedTreeEntriesIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```